src/Documents/ВозвратПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ВозвратПоставщику</Name>
			<BasedOn>
				<xr:Item>Document.Поступление</xr:Item>
				<xr:Item>Document.ПоступлениеДенежныхСредств</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ЗапасыНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеВозврата</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поступление</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОплачено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Запасы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОснованиеВозврата</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Поступление</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ВозвратПоставщику/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

// Процедура - обработчик события "ОбработкаЗаполнения" объекта
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения <> Неопределено Тогда 
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Поступление") Тогда
			Контрагент         = ДанныеЗаполнения.Контрагент;
			Склад              = ДанныеЗаполнения.Склад;
			СтруктурнаяЕдиница = ДанныеЗаполнения.СтруктурнаяЕдиница;
			ОснованиеВозврата  = ДанныеЗаполнения.Ссылка;
			Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
			                      |	ПоступлениеЗапасы.Номенклатура КАК Номенклатура,
			                      |	ПоступлениеЗапасы.Партия КАК Партия,
			                      |	ПоступлениеЗапасы.Количество КАК Количество,
			                      |	ПоступлениеЗапасы.Цена КАК Цена,
			                      |	ПоступлениеЗапасы.Сумма КАК Сумма,
			                      |	ПоступлениеЗапасы.СтавкаНДС КАК СтавкаНДС,
			                      |	ПоступлениеЗапасы.СуммаНДС КАК СуммаНДС,
			                      |	ПоступлениеЗапасы.Всего КАК Всего,
			                      |	ПоступлениеЗапасы.Упаковка КАК Упаковка,
			                      |	ПоступлениеЗапасы.КоличествоУпаковок КАК КоличествоУпаковок,
			                      |	ПоступлениеЗапасы.Ссылка КАК ОснованиеВозврата,
			                      |	ПоступлениеЗапасы.Ссылка.Договор КАК Договор
			                      |ИЗ
			                      |	Документ.Поступление.Запасы КАК ПоступлениеЗапасы
			                      |ГДЕ
			                      |	ПоступлениеЗапасы.Ссылка = &ДокументОснование");
			Запрос.УстановитьПараметр("ДокументОснование", ДанныеЗаполнения.Ссылка);
			
			Запасы.Загрузить(Запрос.Выполнить().Выгрузить());
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеДенежныхСредств") Тогда	
			Контрагент = ДанныеЗаполнения.Контрагент;			
		КонецЕсли;
	КонецЕсли;

	// Заполнение реквизитов документа по умолчанию
	ОбщегоНазначенияСтоматология.ЗаполнитьРеквизитыОбъектаПоУмолчанию(ЭтотОбъект, , ДанныеЗаполнения);
	
КонецПроцедуры

// Процедура - обработчик события "ПриКопировании" объекта
//
Процедура ПриКопировании(ОбъектКопирования)
	
	СуммаОплачено = 0;
	Договор       = Неопределено; 
	// Заполнение реквизитов документа по умолчанию
	ОбщегоНазначенияСтоматология.ЗаполнитьРеквизитыОбъектаПоУмолчанию(ЭтотОбъект, ОбъектКопирования);
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	
	// Инициализация дополнительных свойств для проведения документа.
	ДвиженияДокументовСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	Документы.ВозвратПоставщику.УстановитьНачальныеДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	ДополнительныеСвойства.Вставить("СтруктураПолейПерегрузка", Новый Структура("ОснованиеВозврата", "ОснованиеВозврата"));
	УправлениеЗапасамиПартионныйУчет.СформироватьСписаниеТаблицаПартииТоваров(Ссылка.Запасы, ДополнительныеСвойства, Движения, Отказ);	
	// Движения по регистрам
	ДвиженияДокументовСервер.ЗапасыНаСкладах(ДополнительныеСвойства, Движения, Отказ);   	
	ДвиженияДокументовСервер.ВзаиморасчетыСКонтрагентами(ДополнительныеСвойства, Движения, Отказ); 
	ДвиженияДокументовСервер.ПартииТоваров(ДополнительныеСвойства, Движения, Отказ);
	ДвиженияДокументовСервер.Управленческий(ДополнительныеСвойства, Движения, Отказ);

	// Запись наборов записей.
	ДвиженияДокументовСервер.ДобавитьНаборыЗаписей(ЭтотОбъект);
	
	
КонецПроцедуры

// Обработка проверки заполнения объекта
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Проверка табличной части на разрешения по значениям 
	Если ПользователиСтоматология.ПолучитьБулевоЗначениеПраваПользователя(ПланыВидовХарактеристик.ПраваПользователей.РазрешитьНулевуюСумму, Ложь) Тогда
		УдаляемыйЭлемент = ПроверяемыеРеквизиты.Найти("Запасы.Сумма");
		Если УдаляемыйЭлемент <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(УдаляемыйЭлемент);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
